Repository: dias-smith-rock/AIFamily
Catalog: reminder/Localization/Location.xcstrings
Source language: en
Languages: zh_hans, zh_hant

# location_choose_how_long_to_hide_your_location
source: Choose how long to hide your location
zh_hans: 选择隐藏位置的时长
zh_hant: 選擇隱藏位置的時長

# location_collapse_location_sharing
source: Collapse location sharing
zh_hans: 收起位置共享
zh_hant: 收起位置共享

# location_control_when_you_share_location_toggle_ghost_mod
source: Control when you share location—toggle ghost mode anytime for private independence.
zh_hans: 自由掌控位置共享时机，一键开启，随时切换独立隐私。
zh_hant: 自由掌控位置共享時機，一鍵開啟，隨時切換獨立隱私。

# location_current_user_always_shown_on_the_map
source: Current user, always shown on the map
zh_hans: 当前用户，始终在地图上显示
zh_hant: 目前使用者，始終在地圖上顯示

# location_enter_live_location_mode
source: Enter live location mode
zh_hans: 进入实时位置模式
zh_hant: 進入即時位置模式

# location_exit_live_location_mode
source: Exit live location mode
zh_hans: 退出实时位置模式
zh_hant: 退出即時位置模式

# location_expand_location_sharing
source: Expand location sharing
zh_hans: 展开位置共享
zh_hant: 展開位置共享

# location_live_location_active_lld_people
source: ⚡️ Live location active (%lld people)
zh_hans: ⚡️ 实时位置进行中（%lld 人）
zh_hant: ⚡️ 即時位置進行中（%lld 人）

# location_live_location_lld_online
source: ⚡️ Live location · %lld online
zh_hans: ⚡️ 实时位置 · %lld 人在线
zh_hant: ⚡️ 即時位置 · %lld 人在線

# location_locate_my_location
source: Locate my location
zh_hans: 定位到我的位置
zh_hant: 定位到我的位置

# location_location
source: Location
zh_hans: 地理位置
zh_hant: 地理位置

# location_location_2
source: Location
zh_hans: 位置
zh_hant: 位置

# location_location_hidden
source: %@ · 👻 Location hidden
zh_hans: %@ · 👻 位置已隐藏
zh_hant: %@ · 👻 位置已隱藏

# location_location_hidden_2
source: %@, location hidden
zh_hans: %@，位置已隐藏
zh_hant: %@，位置已隱藏

# location_location_not_added
source: Location not added
zh_hans: 尚未添加位置
zh_hant: 尚未新增位置

# location_location_privacy_trail
source: Location privacy & trail
zh_hans: 位置隐私与轨迹
zh_hant: 位置隱私與軌跡

# location_map_shows_only_the_latest_location_point_ghost_m
source: Map shows only the latest location point; ghost mode unavailable.
zh_hans: 地图仅显示最新 1 个位置点，不支持位置隐身。
zh_hant: 地圖僅顯示最新 1 個位置點，不支援位置隱身。

# location_map_shows_up_to_3_history_points_ghost_mode_unav
source: Map shows up to 3 history points; ghost mode unavailable.
zh_hans: 地图最多显示 3 个历史位置点，不支持位置隐身。
zh_hant: 地圖最多顯示 3 個歷史位置點，不支援位置隱身。

# location_n_20_location_history_points
source: 20 location history points
zh_hans: 20 条位置历史轨迹
zh_hant: 20 條位置歷史軌跡

# location_no_location_yet_will_appear_on_the_map_when_loca
source: %@, no location yet; will appear on the map when location data is available
zh_hans: %@，暂无位置，勾选后将在有定位数据时显示
zh_hant: %@，暫無位置，勾選後將在有定位資料時顯示

# location_privacy_ghost_mode
source: Privacy ghost mode
zh_hans: 隐私隐身模式
zh_hant: 隱私隱身模式

# location_refresh_locations
source: Refresh locations
zh_hans: 刷新位置
zh_hant: 重新整理位置

# location_search_or_add_a_location
source: Search or add a location
zh_hans: 搜索或添加位置
zh_hant: 搜尋或新增位置

# location_set_location_to_always_in_settings_to_update_you
source: Set location to Always in Settings to update your position in the background.
zh_hans: 请在系统设置中将位置设为「始终」，才能在后台更新位置。
zh_hant: 請在系統設定中將位置設為「始終」，才能在背景更新位置。

# location_shown_on_the_map_when_selected
source: %@, shown on the map when selected
zh_hans: %@，已选中时在地图上显示
zh_hant: %@，已選取時在地圖上顯示

# location_tracked_bind_title
source: Bind location device
zh_hans: 绑定定位设备
zh_hant: 綁定定位裝置

# location_tracked_bind_subtitle
source: Ask %@'s device to scan this code in WeSync. No account signup needed.
zh_hans: 请用%@的手机在 WeSync 中扫描此码。无需注册账号。
zh_hant: 請用%@的手機在 WeSync 中掃描此碼。無需註冊帳號。

# location_tracked_generating_code
source: Generating pairing code…
zh_hans: 正在生成配对码…
zh_hant: 正在產生配對碼…

# location_tracked_code_expires_hint
source: Code expires in 30 minutes and can be used once.
zh_hans: 配对码 30 分钟内有效，且仅可使用一次。
zh_hant: 配對碼 30 分鐘內有效，且僅可使用一次。

# location_tracked_pin_setup_hint
source: Set the parent PIN on the member profile. The child phone uses that PIN after pairing.
zh_hans: 请在成员档案中设置家长 PIN。小孩机配对后会自动同步，无需在本机设置。
zh_hant: 請在成員檔案中設定家長 PIN。小孩機配對後會自動同步，無需在本機設定。

# location_tracked_enter_pairing_code
source: 6-digit pairing code
zh_hans: 6 位配对码
zh_hant: 6 位配對碼

# location_tracked_claim_footer
source: Get the code from a parent’s Bind location device screen.
zh_hans: 请向家长索取「绑定定位设备」中的配对码。
zh_hant: 請向家長索取「綁定定位裝置」中的配對碼。

# location_tracked_set_parent_pin
source: Parent PIN (4–6 digits)
zh_hans: 家长 PIN（4–6 位数字）
zh_hant: 家長 PIN（4–6 位數字）

# location_tracked_confirm_parent_pin
source: Confirm PIN
zh_hans: 确认 PIN
zh_hant: 確認 PIN

# location_tracked_pin_footer
source: Leave empty to skip the kid-app password. Or set 4 to 6 digits.
zh_hans: 留空则不设置小孩机应用密码。也可设置 4 到 6 位数字。
zh_hant: 留空則不設定小孩機應用程式密碼。也可設定 4 到 6 位數字。

# location_tracked_claim_title
source: Pair as location device
zh_hans: 配对为定位设备
zh_hant: 配對為定位裝置

# location_tracked_claim_card_subtitle
source: Scan or enter a parent pairing code. Location only — no signup.
zh_hans: 扫描或输入家长配对码。仅上报位置，无需注册。
zh_hant: 掃描或輸入家長配對碼。僅上報位置，無需註冊。

# location_tracked_shell_group
source: Group
zh_hans: 群组
zh_hant: 群組

# location_tracked_shell_location_status
source: Location permission
zh_hans: 定位权限
zh_hant: 定位權限

# location_tracked_shell_background
source: Background reporting
zh_hans: 后台上报
zh_hant: 後台上報

# location_tracked_shell_battery
source: Battery
zh_hans: 电量
zh_hant: 電量

# location_tracked_shell_last_report
source: Last report
zh_hans: 上次上报
zh_hant: 上次上報

# location_tracked_shell_footer
source: This device reports approximate location about every few minutes when moving. Not real-time like Find My.
zh_hans: 本机在移动时大约每隔数分钟上报大致位置，并非查找类实时定位。
zh_hant: 本機在移動時大約每隔數分鐘上報大致位置，並非尋找類即時定位。

# location_tracked_unlock_with_pin
source: Unlock with parent PIN
zh_hans: 用家长 PIN 解锁
zh_hant: 用家長 PIN 解鎖

# location_tracked_enter_parent_pin
source: Parent PIN
zh_hans: 家长 PIN
zh_hant: 家長 PIN

# location_tracked_unlock_message
source: Temporarily open full app tabs. Auto-locks after 15 minutes.
zh_hans: 临时打开完整功能。约 15 分钟后自动锁回。
zh_hant: 臨時打開完整功能。約 15 分鐘後自動鎖回。

# location_tracked_pin_incorrect
source: Incorrect PIN
zh_hans: PIN 不正确
zh_hant: PIN 不正確

# location_tracked_shell_title
source: Location device
zh_hans: 定位设备
zh_hant: 定位裝置

# location_tracked_auth_always
source: Always
zh_hans: 始终
zh_hant: 永遠

# location_tracked_auth_when_in_use
source: While Using — set Always in Settings
zh_hans: 使用 App 期间 — 请在设置中改为始终
zh_hant: 使用 App 期間 — 請在設定中改為永遠

# location_tracked_auth_denied
source: Denied
zh_hans: 已拒绝
zh_hant: 已拒絕

# location_tracked_auth_needed
source: Not granted
zh_hans: 未授权
zh_hant: 未授權

# location_tracked_background_on
source: On
zh_hans: 已开启
zh_hant: 已開啟

# location_tracked_background_off
source: Off or limited
zh_hans: 关闭或受限
zh_hant: 關閉或受限

# location_tracked_no_report_yet
source: No report yet
zh_hans: 尚未上报
zh_hant: 尚未上報

# location_tracked_pairing_invalid_code
source: Invalid pairing code
zh_hans: 配对码无效
zh_hant: 配對碼無效

# location_tracked_pairing_code_expired
source: Pairing code expired
zh_hans: 配对码已过期
zh_hant: 配對碼已過期

# location_tracked_pairing_code_used
source: Pairing code already used
zh_hans: 配对码已使用
zh_hant: 配對碼已使用

# location_tracked_pairing_profile_bound
source: This profile is already bound to another device
zh_hans: 该成员已绑定其他设备
zh_hant: 該成員已綁定其他裝置

# location_tracked_pairing_already_member
source: This account is already in the group with another profile
zh_hans: 此账号已在群组中绑定其他成员
zh_hant: 此帳號已在群組中綁定其他成員

# location_tracked_pairing_backend_required
source: Server update required. Please try again later.
zh_hans: 需要服务端更新，请稍后重试。
zh_hant: 需要伺服器更新，請稍後重試。

# location_tracked_bind_device_action
source: Bind location device
zh_hans: 绑定定位设备
zh_hant: 綁定定位裝置

# location_tracked_bind_device_footer
source: Generate a one-time code for a child’s phone to report location only.
zh_hans: 生成一次性配对码，供小孩手机仅上报位置。
zh_hant: 產生一次性配對碼，供小孩手機僅上報位置。

# location_tracked_lock_shell_again
source: Lock location-only mode
zh_hans: 锁回定位模式
zh_hant: 鎖回定位模式

# location_tracked_lock_shell_footer
source: Hide schedule, todos, and wallet again. Requires parent PIN to unlock.
zh_hans: 重新隐藏日程、待办与账本。需家长 PIN 才能解锁。
zh_hant: 重新隱藏日程、待辦與帳本。需家長 PIN 才能解鎖。

# location_tracked_possibly_offline
source: May be offline
zh_hans: 可能离线
zh_hant: 可能離線

# location_tracked_device_section
source: Location device
zh_hans: 定位设备
zh_hant: 定位裝置

# location_tracked_device_bound
source: Bound
zh_hans: 已绑定
zh_hant: 已綁定

# location_tracked_device_unbound
source: Not bound
zh_hans: 未绑定
zh_hant: 未綁定

# location_tracked_rebind_device_action
source: Rebind location device
zh_hans: 重新绑定定位设备
zh_hant: 重新綁定定位裝置

# location_tracked_parent_pin
source: Parent PIN
zh_hans: 家长 PIN
zh_hant: 家長 PIN

# location_tracked_pin_not_set
source: Leave empty for no kid-app password, or enter 4 to 6 digits.
zh_hans: 留空表示不设置小孩机应用密码；也可输入 4 到 6 位数字。
zh_hant: 留空表示不設定小孩機應用程式密碼；也可輸入 4 到 6 位數字。

# location_tracked_save_pin
source: Save PIN
zh_hans: 保存 PIN
zh_hant: 儲存 PIN

# location_tracked_pin_takes_effect_hint
source: Takes effect the next time this device is online.
zh_hans: 将在该设备下次联网后生效。
zh_hant: 將在該裝置下次連線後生效。

# location_tracked_pin_invalid
source: PIN must be 4 to 6 digits.
zh_hans: PIN 须为 4 到 6 位数字。
zh_hant: PIN 須為 4 到 6 位數字。

# location_tracked_scan_qr
source: Scan QR code
zh_hans: 扫描二维码
zh_hant: 掃描二維碼

# location_tracked_no_valid_pairing_code
source: No valid pairing code found. Scan the code from a parent phone.
zh_hans: 未识别到有效配对码。请扫描家长手机上的二维码。
zh_hant: 未識別到有效配對碼。請掃描家長手機上的二維碼。

# location_tracked_pairing_success
source: Paired successfully
zh_hans: 配对成功
zh_hant: 配對成功

# location_tracked_pairing_success_message
source: This phone is now a location device. The parent PIN is set on the family profile.
zh_hans: 此手机已绑定为定位设备。家长 PIN 由家庭档案管理，无需在本机设置。
zh_hant: 此手機已綁定為定位裝置。家長 PIN 由家庭檔案管理，無需在本機設定。

# location_tracked_admin_bind_success
source: Location device paired
zh_hans: 定位设备已绑定
zh_hant: 定位裝置已綁定

# location_tracked_admin_bind_success_message
source: %@ is now bound as a location device.
zh_hans: %@ 的定位设备已绑定成功。
zh_hant: %@ 的定位裝置已綁定成功。

# location_tracked_device_model
source: Device model
zh_hans: 设备型号
zh_hant: 裝置型號

# location_tracked_device_model_unknown
source: Unknown device
zh_hans: 未知设备
zh_hant: 未知裝置

# location_tracked_device_bound_at
source: Bound at
zh_hans: 绑定时间
zh_hant: 綁定時間

# location_tracked_device_bound_at_unknown
source: Unknown
zh_hans: 未知
zh_hant: 未知

# location_tracked_location_needed_title
source: Turn on Location
zh_hans: 需要定位权限
zh_hant: 需要定位權限

# location_tracked_location_needed_message
source: This location device needs Location set to Always. Open Settings to turn it on.
zh_hans: 请在设置中将定位设为「始终」，以便家人看到这台设备的位置。
zh_hant: 請在設定中將定位設為「永遠」，以便家人看到這台裝置的位置。

# location_tracked_open_settings
source: Open Settings
zh_hans: 打开设置
zh_hant: 打開設定

# location_tracked_auth_services_off
source: Location Services off
zh_hans: 系统定位已关闭
zh_hant: 系統定位已關閉

# location_tracked_location_services_off_message
source: Turn on Location Services in Settings, then set this app to Always.
zh_hans: 系统「定位服务」总开关已关闭，因此权限会显示为已拒绝。请先在设置中打开定位服务，再将本应用设为「始终」。
zh_hant: 系統「定位服務」總開關已關閉，因此權限會顯示為已拒絕。請先在設定中打開定位服務，再將本應用設為「永遠」。

# location_history_choose_date
source: Choose a date range
zh_hans: 选择日期范围
zh_hant: 選擇日期範圍

# location_history_yesterday
source: Yesterday
zh_hans: 昨天
zh_hant: 昨天

# location_history_last_3_days
source: Last 3 days
zh_hans: 最近三天
zh_hant: 最近三天

# location_history_last_7_days
source: Last 7 days
zh_hans: 最近一周
zh_hant: 最近一週

# location_history_last_30_days
source: Last 30 days
zh_hans: 最近一月
zh_hant: 最近一月

# location_history_custom
source: Custom
zh_hans: 自定义
zh_hant: 自訂

# location_history_custom_title
source: Custom dates
zh_hans: 自定义日期
zh_hant: 自訂日期

# location_history_start_date
source: Start date
zh_hans: 开始日
zh_hant: 開始日

# location_history_end_date
source: End date
zh_hans: 结束日
zh_hant: 結束日

# location_history_no_points_in_range
source: No location in this period
zh_hans: 该时段无位置
zh_hant: 此時段無位置
